wintersmith/contents/articles/linux/2013-04-04-use-hid-replace-jekyll-to-blog.html
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">HID介绍</a></li>
<li><a href="#sec-2">HID安装</a></li>
<li><a href="#sec-3">HID生成静态网站</a></li>
<li><a href="#sec-4">以我我的为例子</a></li>
</ul>
</div>
</div>
---
date: 2013-04-04
template: tech.jade
title: 使用perl模块HiD取代jekyll编写blog
category: Linux
change_frequency: monthly
---

<p>
jekyll 是一个非常好用的静态站点生成器，支持插件，可以用来增强它。
</p>

<p>
如今，许多技术人员的blog开始放在github上面，github同时支持jekyll的基本功能。
</p>

<p>
经过一些配置，就可以使用org+jekyll+github完成blog的编写到发布。
</p>

<p>
jekyll使用ruby开发，因为我没有学过ruby，也不打算学，所以一直希望能够有个Perl的类似程序，以便代替jekyll。
</p>

<p>
于是，在CPAN上面发现了这个模块：<a href="https://github.com/genehack/HiD">HID</a>, 类似的模块当然很多，而且灵感都起于jekyll，之所以选这个模块是因为它和
jekyll的相似度非常高。
</p>

<p>
美中不足的是，它还有待完善，因为还不能支持全局的分类和tag之类的功能，虽然为它添加这个功能非常简单（我已经添加）。
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">HID介绍</h2>
<div class="outline-text-2" id="text-1">
<p>
HID的作者维护的版本还没有将categories和tags导出到site变量，而且代码中有点bug，对utf8的title会有问题。
</p>

<p>
我fork了作者的代码，添加了categories和tags的导出，修正了一些问题，目前来看，可以导出同jekyll一样的结果，而且支持一个after\<sub>publish插件。</sub>
</p>

<p>
通过after\<sub>publish插件，可以进行生成分类文章索引、sitemap等自己想要的东西。</sub>
</p>

<p>
pull-request已经提交给作者，等待merge，现在使用可以从我的<a href="https://github.com/ChinaXing/HiD">repo</a> 里面clone，然后安装。
</p>

<p>
此外，我已经写好了生成分类索引页和sitemap的插件，也可以从这里下载，然后放入你的blog目录的<sub>plugin目录。</sub>
</p>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">HID安装</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>从github clone代码
<div class="org-src-container">

<pre class="src src-sh">git clone git://github.com/ChinaXing/HiD.git
</pre>
</div>
</li>
<li>安装此perl模块
<div class="org-src-container">

<pre class="src src-sh">cd HID &amp;&amp; dzil build
cd HID-0.5 &amp;&amp; perl Makefile.PL &amp;&amp; make &amp;&amp; make install
</pre>
</div>
</li>
</ul>
<p>
安装完成后，会有一个*hid*命令，这个命令类似jekyl。
</p>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">HID生成静态网站</h2>
<div class="outline-text-2" id="text-3">
<p>
使用hid命令来生成静态页面，类似jekyll，只要在目录内部执行`hid publish`即可，hid的配置也类似jekyll，因为它们一样的思想。
</p>

<p>
生成静态网站后，如果想本地测试，运行`hid server`，会在本地启动一个plack服务器，端口默认5000，此功能需要你安装Plack::Runner模块。
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">以我我的为例子</h2>
<div class="outline-text-2" id="text-4">
<p>
举例我的blog的目录结构：
</p>
<div class="org-src-container">

<pre class="src src-sh">tree -L 2 ~/ChinaXing.org/
</pre>
</div>
<pre class="example">
ChinaXing.org/
├── build.sh
├── HiD
│   ├── _config.yml
│   ├── _layouts
│   ├── _plugins
│   ├── _posts
│   ├── CNAME
│   ├── favicon.ico
│   ├── images
│   ├── index.html
│   ├── robots.txt
│   ├── scripts
│   ├── search.html
│   └── stylesheet
├── org
│   ├── _layouts
│   ├── _posts
│   ├── images
│   ├── index.org
│   ├── scripts
│   ├── search.org
│   └── stylesheet
└── www
    ├── CNAME
    ├── favicon.ico
    ├── images
    ....
</pre>
</div>
</div>
